class_name: Model
config:
  input_layers:
  - [output_as_input, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: &id001 !!python/tuple [256, 20, 201]
      input_dtype: float32
      name: output_as_input
    inbound_nodes: []
    name: output_as_input
  - class_name: LSTM
    config:
      U_regularizer: null
      W_regularizer: null
      activation: tanh
      b_regularizer: null
      batch_input_shape: *id001
      consume_less: cpu
      dropout_U: 0.0
      dropout_W: 0.0
      forget_bias_init: one
      go_backwards: false
      init: glorot_uniform
      inner_activation: hard_sigmoid
      inner_init: orthogonal
      name: lstm
      output_dim: 512
      return_sequences: false
      stateful: true
      trainable: true
      unroll: false
    inbound_nodes:
    - - [output_as_input, 0, 0]
    name: lstm
  - class_name: RepeatVector
    config: {n: 20, name: repeatvector_1, trainable: true}
    inbound_nodes:
    - - [lstm, 0, 0]
    name: repeatvector_1
  - class_name: LSTM
    config:
      U_regularizer: null
      W_regularizer: null
      activation: tanh
      b_regularizer: null
      batch_input_shape: !!python/tuple [256, 20, 512]
      consume_less: cpu
      dropout_U: 0.0
      dropout_W: 0.0
      forget_bias_init: one
      go_backwards: false
      init: glorot_uniform
      inner_activation: hard_sigmoid
      inner_init: orthogonal
      name: lstm_decoder
      output_dim: 512
      return_sequences: true
      stateful: true
      trainable: true
      unroll: false
    inbound_nodes:
    - - [repeatvector_1, 0, 0]
    name: lstm_decoder
  - class_name: TimeDistributed
    config:
      layer:
        class_name: Dense
        config: {W_constraint: null, W_regularizer: null, activation: linear, activity_regularizer: null,
          b_constraint: null, b_regularizer: null, bias: true, init: glorot_uniform,
          input_dim: null, name: dense_1, output_dim: 201, trainable: true}
      name: output
      trainable: true
    inbound_nodes:
    - - [lstm_decoder, 0, 0]
    name: output
  name: model_1
  output_layers:
  - [output, 0, 0]
keras_version: 1.0.3
